import { Component } from '@angular/core';
import { JSEncrypt } from 'jsencrypt';
import { SwiperOptions } from 'swiper';

@Component({
  selector: 'app-root',
  templateUrl: './app.component.html',
  styleUrls: ['./app.component.less']
})
export class AppComponent {
  public_key=`-----BEGIN PUBLIC KEY-----
MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEA7vbinNPnt1Xvl5mXWqcA
cPQpfI5gHqd3J5/auiPiqB1IkA0FQ5Tts7YkAa+1bEAHLmC38wKcuRcdTnN22Syz
KbEFe/SjQbvpsn+6iV8dMa+2qqv06dLAceB0lD642iFhYv8UjOnZKbzHozgfiHEe
1Fi1Lmr6a6islS8pCAnUS0s/68SHyjCm47ubVTUw+8bywrB7wvQlLKBtc+V1K9US
8i+LZTMh0zGs8vgRezIM/9uI8+YdCk/mOfzX55iPUTIigyZu0qDAs/zhVOnb+Ppq
bVO7Y28s9QnMtY7/gg2BtjXgXadh4kJsqhO5XFMI6+yd0sLaryb4Zinpt7YIeL/q
qwIDAQAB
-----END PUBLIC KEY-----`;
  encrypted = '';
  dummy_bio='לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית ושבעגט ליבם סולגק. בראיט ולחת צורק מונחף, בגורמי מגמש. תרבנך וסתעד לכנו סתשם השמה - לתכי מורגם בורק? לתיג ישבעס.';
  dummy_q1=' הועניב היושבב שערש שמחויט - שלושע ותלברו חשלו שעותלשך וחאית נובש ערששף. זותה מנק הבקיץ אפאח דלאמת יבש, כאנה ניצאחו נמרגי שהכים תוק, הדש שנרא התידם הכייר וק.';
  dummy_q2=' נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף לפרומי בלוף קינץ תתיח לרעח. לת צשחמי לורם איפסום דולור סיט אמט, קונדימנטום קורוס בליקרה, נונסטי קלובר בריקנה סטום, לפריקך תצטריק לרטי. ';
  dummy_q3=' סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דול, צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש. קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן מנת. קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף לפרומי בלוף קינץ תתיח לרעח. לת צשחמי צש בליא, מנסוטו צמלח לביקו ננבי, צמוקו בלוקריה שיצמה ברורק.';
  dummy_photo='assets/img/profile.png'
  names = [];
  vote = [];
  crypt = new JSEncrypt();
  randId = 0;
  swiperConfig: SwiperOptions = {
    pagination: { el: '.swiper-pagination', clickable: true },
    navigation: {
      nextEl: '.swiper-button-next',
      prevEl: '.swiper-button-prev'
    },
    spaceBetween: 30,
    loop: true,
  };

  constructor() {
    this.crypt.setPublicKey(this.public_key);
    this.names = [
      {
        "bio": "אני מתנדב בסדנא כבר עשור. התחלתי ב-Commitים בקטנה לכנסת פתוחה, עברתי דרך הקהילה הירושלמית, הייתי חבר וועד, עברתי לגייס משאבים, כתבתי קוד עבור AnyWay ועכשיו אני שמח לחזור לוועד של הסדנא. ביום יום אני ראש צוות פיתוח בחברת Armis, בערבים אני יושב בוועדים מנהלים של כמה עמותות אחרות בתחומים אחרים לגמרי (לימוד השפה הערבית, חינוך מוסיקלי...) ומנהל את קהילת Urban Dads Tel Aviv.\nהסדנא יקרה לי מאוד ובעיניי היא היא כלב השמירה של הדמוקרטיה הישראלית.",
        "file_url": "",
        "name": "אגם רפאלי-פרהדיאן",
        "photo": "assets/img/agam_refaeli.jpg",
        "q1": "",
        "q2": ""
      },
      {
        "bio": "אסטרופיסיקאית בהכשרה מכהנת כיום מנכלית למחקר ופיתוח ברפאל. דירקטורית החברות בארץ ובעולם. חברה בוועד המנהל של הטכניון ובקורטוריון. פועלת לקידום חינוך מדעי טכנולוגי בפריפריה וקידום נשים. חברה בקבינט המקצועי של פרופ גמזו ומובילה של צוותים אסטרטגים במגוון נושאים.",
        "file_url": "https://drive.google.com/open?id=1ERePxR1pJB3ANB4ODh8JM7VkyavQ48Nd",
        "name": "אירית אידן",
        "photo": "https://www.hasadna.org.il/wp-content/uploads/2019/06/Irit-Idan-200x200.png",
        "q1": "מדידת ההשפעה - מורכבת ממספר פרמטרים : כמות איכות השפעה. כמות גידול במספר העבודות במימון שלהם. איכות - זכייה בעבודות בתחרות עם שיפוט הצעות. איכות - מדד לדוגמא מספר הכניסות/שימושים בתוצרים",
        "q2": "המשך הסתכלות בראייה אסטרטגית על יעדי הסדנא וחיזוקה.   המשך חיבור לקידום עבודות נוספות.",
        "current": true
      },
      {
        "bio": "אני גיל מלמד, בוגר כלכלה וניהול ולימודי תעודה בעיתונאות (אונ' תל-אביב), עיתונאי רכב מאז שנת 1986 בכלי תקשורת מרכזיים וביניהם: 'טלגרף', 'ידיעות אחרונות', 'מעריב’ וכן בעיתונות רכב (עורך 'טורבו', ממקימי ‘מוטו’). אני מתמחה בעיקר בתעשיית הרכב והתחבורה החכמה, בבטיחות בדרכים, ובפוליטיקה של תחבורה בארץ ובעולם, עורך אתר הרכב TheCar ופעיל לקידום הדמוקרטיה בישראל. \nאני מאמין שמידע אמין, שקוף, חף מאינטרסים, ונגיש, הוא נוזל החיים של דמוקרטיה מתפקדת. ככל שהוא חסר, נגוע, או בלתי זמין כך חשופים הציבור ושיטת הממשל לזיהומים וסכנות קיומיות.\nמאז הקמת הסדנא לידע ציבורי אני משתמש, לצורך עבודתי העיתונאית, בחלק מן הכלים שהסדנא יצרה. אני מעריך מאד את ההשקעה האדירה שנדרשה כדי להקים אותם  ומעריץ את המתנדבים שגורמים לזה לקרות. עם זאת, כמשתמש אני נתקל לא אחת במגבלות של הכלים האלה ככל שהם נוגעים ספציפית לצרכים שלי, ונכון להיום לא הייתה לי יכולת להשפיע עליהם כדי להרחיב את היכולות, ואיתן גם את מעגל המשתמשים בהם.",
        "file_url": "https://drive.google.com/open?id=1atWTaLj79aylHqZE49n94suTaXmh-HbP",
        "name": "גיל מלמד",
        "photo": "assets/img/gil_melamed.jpg",
        "q1": "היעד הראשון במעלה לסדנא הוא יצירת כמויות גדולות של מידע בעל משמעות, להבדיל ממידע גולמי. יעד זה לא חי בפני עצמו אלא רק יחד עם היעד השני, שהוא הכרה ציבורית בגוף שמפיק אותו ובניקיון וחוסר ההטיה של המידע, ועם היעד השלישי שהוא חשיפה ציבורית רחבה. בפשטות: הסדנא לידע ציבורי צריכה להיות אחותה החכמה והטהורה של ויקיפדיה. נגישה מאד, מפורסמת מאד, אינטליגנטית אך גם עממית וקלה לשימוש.  \nיעד נוסף הוא ההשפעה הציבורית, וזה יעד איכותי: האם מקבלי החלטות וגופי ביצוע עושים שימוש במידע שמופק בסדנא?\nהמדדים לעמידה ביעדים הם כמות המידע, שיעורי החשיפה, כמות השימוש, מספר המשתמשים, איכות האזכורים, אחוז האזכורים החיוביים ומספר השימושים של מקבלי החלטות.",
        "q2": "הניסיון הרלבנטי שלי הוא כמשתמש, כעיתונאי, וכמי שמעורב בתהליכי קבלת החלטות בתחום הספציפי שלי – תחבורה ורכב. אני מתכוון לתרום לסדנא בייעוץ בחיזוק ממשקי השימוש במידע עבור כל צינורות הפצת הידע: עיתונאים, בלוגרים והגיגנים, סיוע בגיבוש אסטרטגיה תקשורתית לסדנא והתמקדות בכלים מחוללי שינוי, בדגש על השפעה על סדר היום של נציגי הציבור בכנסת ועל הפקידות הממשלתית. היכרות ארוכת שנים עם התקשורת הישראלית הממוסדת והאלטרנטיבית, וניסיון אישי בדליית מידע, מאפשרים לי להצביע על דרכים להפיכת הממשקים ליעילים וזמינים. אני מתכוון לסייע בגיבוש אסטרטגיה תקשורתית לסדנא, ולהתמקד בכלים מחוללי שינוי.\nלהרחבה מוזמנים להציץ בקובץ המצורף."
      },
      {
        "bio": "בחודשים האחרונים אני שותף מייסד בהקמת COE למעבר לענן.ב - 6 השנים האחרונות הייתי סגן ראש מטה ישראל דיגיטלית לטכנולוגיות וקידום טרנספורמציה דיגיטלית ברשויות המקומיות. פעלתי רבות לשם קידום עולם המידע הדיגיטלי, על כלל רבדיו וחשיבותו, במרחב הציבורי (בין היתר יזמתי עבודה שעסקה בתחום Data Driven Innovation המהווה בסיס להרבה מהפעילויות הדיגיטליות המבוצעות כיום במגזר הציבורי).הגעתי לישראל דיגיטלית בכוונה להיות שותף ולתרום לתהליך גיבוש חזון דיגיטלי לשירותים והמוצרים הציבוריים ומימוש תהליכי טרנספורמציה דיגיטלית לאומיים לשם ייעולם, שיפורם וקידומם עבור הציבור - \"מימשל חכם וידידותי\".לפני כן, הקמתי והובלתי מספר סטארט-אפים ומיזמים במגוון עולמות תוכן ובטכנולוגיות שונות. בעבר הרחוק - השתחררתי מצה\"ל לאחר שהובלתי את יחידת המחשב של אגף המודיעין ולפני כן את בסמ\"ח - ביה\"ס למקצועות המחשב בממר\"ם.בנוסף, מנחה סדנאות אקדמיות ליזמות.",
        "file_url": "https://drive.google.com/open?id=1z-QsF50pdCYy64o6TywErMJHmUI4QKTH",
        "name": "דרור מרגלית",
        "photo": "assets/img/dror_margalit.png",
        "q1": "גידול בפתיחת מאגרי מידע במרחב הציבורי (ממשלתיים, שלטו מקומי, מונחים ע\"י רגולציה), מונגשים ונגישים (עפ\"י סטנדרטים)\nהעלאת היקף השימוש האיכותי (ע\"י בעלי תפקידים וגופים) בדאטה והתובנות המונגשים ע\"י הסדנא\nהעלאת המודעות הציבורית לפעילות הסדנא\nגידול ההסכמים והפעילויות המשותפות עם גורמים במיגזר הציבורי\nגידול בתקציב העמותה \nגידול בהיקף המתנדבים הפעילים",
        "q2": "עולם המידע - יצירתו, ניהולו, חקירתו לשם קבלת תובנות והנגשתו - הוא הנדבך המרכזי בעידן הדיגיטלי הנוכחי (עידן המידע). \nלדעתי, לסדנא לידע ציבורי, יש חשיבות רבה ותפקיד לאומי מרכזי, בקידום השימוש, השיתוף במידע והנגשתו לציבור.\nאשמח לתרום מנסיוני, כישורי וקשרי לטובת קידום פעילות הסדנא"
      },
      {
        "bio": "שמי דרור, בעל תואר במתמטיקה-מדעי המחשב בהצטיינות מאוניברסיטת תל אביב. מתכנת דוט נט, GIS וקוד פתוח, פעיל חברתי-סביבתי וממייסדי העמותה לכלכלה בת קיימא. עוסק בקיימות בדגש על כלכלה ונושא מוצרים ציבוריים ונחלת הכלל, חבר וועד מנהל ב״ישראל בשביל האופניים״. ייסדתי את אקו-ויקי. פעיל גם בנושאי תחבורה ועירוניות ומקדם בישראל את \"חזון אפס\" גם במסגרת הסדנא.\n\nאני מאמין שהסדנא לידע ציבורי יכולה וצריכה לספק לא רק מידע ונתונים אלה גם ידע,  ולאפשר שינוי משמעותי בחברה הישראלית.",
        "file_url": "https://drive.google.com/open?id=1qrX6QBXZBoS5UcM6w6GU6t8nhFwgJp4C",
        "name": "דרור רשף",
        "photo": "assets/img/dror_reshef.jpg",
        "q1": "הגדלת מספר המשתמשים ו״הלקוחות״ של הסדנא על ידי חשיבה מחדש  על מי הם בעצם הם המשתמשים והקהלים, איזה שימוש יעשו במידע ואיך אפשר להנגיש להם אותו בדרך שימושית. אם בכל חודש נוכל להצביע על משתמשים חדשים, סימן שהצלחנו.\n\nמידת מעורבות של פעילים, ארגונים חברתיים, גופי ממשל, עיריות, עיתונאים, וחברות בפעילות הסדנא תוך שימוש בכלים , מידע וידע שהסנדא מספקת. הגדלת מספר המתנדבים והמתנדבות, והעלאת כמות שיתופי פעולה.",
        "q2": "מעורבות בארגוני מתנדבים ובניית ידע בחברה האזרחית, מתן ידע לקהילות  ושיתופי פעולה עם ארגונים, גופי ממשלה ועיריות. \n\nבניית בסיס ידע ציבורי,  העמקת והרחבת הידע והשיח הציבורי במספר סוגיות חברתיות -כלכליות בינהן אנרגיה מתחדשת, גז-טבעי, תחבורה ותכנון עירוני, תשתיות אופניים , בטיחות בדרכים ומניעת עישון בקרב בני נוער. אימוץ מודלים מוצלחים מהעולם והשפעה על מדיניות הדרג המקצועי בממשלה וברשויות מקומית, ושינוי המדיניות בנושאים אלה."
      },
      {
        "bio": "לשעבר הממונה על הגבלים עסקיים וכיום נשיא המכון לתכנון כלכלי, מומחה לרגולציה בעל ניסיון רב בתחומי הכלכלה והמשפט, עוסק ברפורמות שונות (האחרונה ועדת שטרום) מזה שנים, בדגש על שילוב טכנולוגיה במנגנוני שוק לשם הגברת תחרות. המכון שבניהולי עוסק מאז 2006 בהגברת תחרותיות בשילוב טכנולוגיה ותשתיות, כגון - זאפ בנקאי, הנגשת תשתיות בירורקטיות של טיפול בבקשות ובהיתרים, יצירת מאגרי מידע לטובת צרכנים ועוד.",
        "file_url": "https://drive.google.com/open?id=1S3mco7c_GpMzEEKNohcs6JNCNnxQpPA6",
        "name": "דרור שטרום",
        "photo": "https://www.hasadna.org.il/wp-content/uploads/2019/06/Dror2-200x200.png",
        "q1": "יעדי הסדנא - הנגשת מידע בנושאים סבוכים (כגון פנסיה, תקציבים, בנקאות, שמאות וכיוצ\"ב עשרות תחומים אחרים המתאפיינים בהיותם Complex Goods - לציבור בדרכים זמינות, שקופות ופשוטות למילוי ותפעול. כניסה למקומות בהם יש כשלי שוק במובן זה שאין אינטרס כלכלי מיוצג שידחוף הנגשת הליכים ונושאים מורכבים - לציבור הרחב. מדדים - היקף התוצר המושפע מן התהליכים המונגשים על ידי הסדנא ואכוונת תחומי העיסוק שלה ל\"מתחמים חסומים\" להבנה על ידי ציבור הצרכנים הרחב.",
        "q2": "נסיוני בתחומים ובשווקים המתאפינים בכשלי תחרות וריכוזיות כוח מאפשר תובנות עמוקות לגבי היכן נדרשת במיוחד פעילות הסדנא וכיצד נכון לאכוונה. היכולת הכלכלית למפות גודל של שווקים המתאפיינים בחסמים בירוקרטיים ובכשלי מידע - מאפשרת לנווט את יכולות הסדנא למקומות המשפיעים ביותר על טובת הציבור.",
        "current": true
      },
      {
        "bio": "אני יזם הייטק, אסטרטג חדשנות, קטליסט פיתוח עסקי וכלכלי בעל 22 שנות ניסיון בייזום והובלת פרויקטים בהייטק. פעיל למען קידום ההייטק והחדשנות בחברה הערבית, נשוי ללוריין ואב לשני בנים ומתגורר בעכו.\n\nמייסד שותף ומנכ\"ל של Ascend לניהול חדשנות והשקעות, מייסד ומוביל קהילת MobileMonday Nazareth, מייסד ומנכ\"ל של Markitect, מייסד שותף של Games for Peace, וחבר הנהלת ארגון צופן.\n\nבשנה האחרונה, אני שותף לתכנון וגיבוש תכנית המדיניות לקידום הייטק וחדשנות בחברה הערבית ופרויקטור לקידום התוכנית. \n\nבשאר הזמן אני מרצה, משמש כמנטור חדשנות ומיזמים כלכליים ברשויות המקומיות. כמו כן, מנטור פיתוח עסקי במגוון תכניות להאצת סטארטאפים בארץ ובחו\"ל, ומארגן Roadshows של סטארטאפים לחו“ל. \n\nבין היתר, אני אחראי אזור ומנטור של Slush Global Impact Accelerator. יועץ לכנס מלטה לקידום Science Diplomacy ושת\"פ אזורי ומוביל סדנאות החדשנות בכנס זה. חבר ועדות היגוי של מגוון כנסים (כנס IMVC, כנס רמב\"ם לרפואה דיגיטלית, ועידת נצרת…), וגם מפיק של Nazareth Makeathon, מארגן ומפיק UltraHack, מפיק של HighSchool Hackathon.",
        "file_url": "https://drive.google.com/open?id=1ZgHaYeIS1C3dT7bYuhGd1OcaQNWFWhVR",
        "name": "הנס שקור",
        "photo": "assets/img/hans_s.jpg",
        "q1": "הפיכתה של הסדנא לגוף איתן כלכלית ולעמותה שיכולה לתכנן קדימה בנחת ולא להיאבק על קיומה בכל שנה מחדש. על הסדנא יהיה לבחון ברצינות מודלים של תשלום עבור שירותים (ולא תשלום עבור בניית כלים), ולעקוב אחר מענקים ותמיכות כלכליות ממשלתיות (ומאבק על יצירתן של כאלה).\n\nהנגשת הסדנא לאוכלוסייה הערבית, שילוב הולם של מתנדבים מהחברה הערבית בפעילות הסדנא וקידום ערכי עבודה, התנדבות ושותפות, דבר שהופך לממשי יותר ויותר עם שינוי אופן הפעולה ממפגשים פרונטליים למפגשי זום, דבר שמאפשר התנדבות פעילה מכל מקום.\n\nהקמתו של פרויקט שינוהל ויתוחזק על ידי מתנדבים ערבים ויהודים, במטרה לענות לצורך שנזהה  בארגון/רשות או בחברה הערבית בכללותה, כדוגמא וסמל לאחרים כדוגמתו שיבואו ויעשירו את סט הכלים והשירותים שהסדנא מציעה.",
        "q2": "שותפות פעילה בתהליכי צמיחת הסדנא, בחינת התהליכים, ניצול הכספים וייעול ניהול הפרויקטים עם דגש על יצירת מודלים ברי קיימא. זה מה שאני עושה ביומיום שלי וזה גם מה שאשמח לעשות במידת האפשר בסדנא.\n\nלוקליזציה של הפרויקטים הקיימים בסדנא והנגשתם לאוכלוסייה הערבית- אני חושב שבתוך שנה או שנתיים ניתן יהיה להנגיש את הפרויקטים בסדנא לקהל דוברי הערבית (ולא רק את העמוד הראשי שלהם, אלא גם את הדאטה). זאת על ידי יצירת שיתופי פעולה עם ארגונים וחברות שיוכלו לתרום למפעל חשוב זה, ובאמצעות שימוש בכלים אוטומטיים וידניים.\n\nשילוב מתנדבים ומתנדבות מהחברה הערבית בפרויקטים של הסדנא. בפועל, שליחת קול קורא בערבית לגופים רלוונטיים שאני נמצא עימם בקשר, סיוע בהקמת קמפיין פייסבוק בערבית וטירגוט קהל היעד הרלוונטי.\n\nהטמעת כלי הסדנא בארגונים, חברות ורשויות מקומיות בחברה הערבית, לרבות בגופים איתם אני נמצא בקשר.\n\nגיבוש והבנת צרכים ספציפיים של החברה הערבית ומתן מענה להם במסגרת פרוייקטים חדשים שיוקמו בסדנא, בכפוף ליכולות ולמשאבים של הסדנא. וכמובן, גיוס כספים ייעודים (כולל מתקציב המדינה) להגשמת מטרה זו."
      },
      {
        "bio": "התנדבתי לשירות צבאי באחת מיחידות העילית של חיל האוויר, בעברי עבדתי חמש שנים בתעשייה הביטחונית בתפקיד טכנולוגי ובתפקידי ניהול פרוייקטים. שימשתי כדובר ויועץ פוליטי לחברי כנסת וכיועץ ארגוני. ניהלתי והובלתי מטות ארגון בקמפיינים ארציים ואני בעל יכולת הנעת תהליכי עבודה רוחביים. מסיים לימודי ממשל ודיפלומטיה במרכז הבינתחומי הרצליה, דירקטור ספורטיב בעמותת ספורט עם פעילות בינלאומית, אב לאראל ומתגורר במושב ניר צבי.\n\nמאמין כי מדינת ישראל חדלה מלהתנהל באופן תקין. אין ישיבות ממשלה, מינויי בכירים תקועים, הכנסת נושלה מכוחה והמערכת הפוליטית כולה בכאוס מוחלט. האחריות עוברת אלינו, למגזר השלישי, לאזרחים, לסדנא.",
        "file_url": "https://drive.google.com/open?id=1ajI-VaHk1lGxyB7SSz01LttTGn1u9jZ_",
        "name": "יותם דביר",
        "photo": "assets/img/yotam_dvir.jpg",
        "q1": "כתיבתן של תוכניות עבודה לפרויקטים, גם אם בקווים כלליים, ודגש על אירגון ויצירת תהליכים סדורים.\n\nיצירת קשרים בין פרויקטים, הניתנים לכימות וליצירת תוצר שהוא גדול מסך חלקיו. \n\nיצירת סט כלים אירגוניים לשימושם של מובילי הפרויקטים, שיסייעו להם בניהול מתנדבים, גיוסם, שימורם ושמירה על סיפוקם וחיוכם.",
        "q2": "גיבוש תהליכים בעלי התחלה, אמצע וסוף - מתוך היכרותי עם אירגונים, עם הזירה הפוליטית, עם תהליכי שינוי, ניצור לסדנא ככלל ולכל פרויקט בפרט תהליכים שמתחילים בידע ציבורי ומסתיימים בשינוי ציבורי, גם בצינורות הבירוקרטיים וגם בצינורות הפחות מקובלים.\n\nנבנה תוכנית לייעוץ ניהולי ואירגוני למובילי פרויקטים – ניהול מתנדבים הוא הדבר הכי קשה בעולם. בדרך נכונה, דקה של ניהול מביאה ארבע או חמש דקות עבודה של מתנדב. בדרך לא נכונה, ארבע דקות של ניהול מביאות דקת עבודה של מתנדב. אשמח להעביר את הניסיון שלי בניהול מתנדבים מהשנים האחרונות הלאה למובילי הפרויקטים, לסייע להם לקדם את הפרוייקטים שלהם, להישאר עם חיוך, ולהעלות חיוך על פניהם של המתנדבים. \n\nנייצר מנגנון לזיהויי הזדמנויות ויצירת מומנטום - הזדמנויות שניתן לנצל לקידום הסדנא מקיפות אותנו יום יום. החל מאירועים פוליטיים, וכלה בחקיקה או העברה בועדת הכספים. אני מאמין שאוכל להתריע כאשר צצה הזדמנות שעלינו לקפוץ עליה, ולנצל לטובתנו."
      },
      // {
      //   "bio": "יותם מנור, בן 32 ,גר בתל אביב עם הילי. יותם חבר בוועד המנהל בשלוש השנים האחרונות, מכהן כיו\"ר הוועד, ומתנדב בסדנא מאז 2014 .יותם הקים והוביל את פרוייקט כיכר המדינה, ולקח חלק כמתנדב או כפרילנסר במספר פרויקטים סדנאיים נוספים כמו הכיתה, הכיתה02, כנסת פתוחה, ושימור.קום.\n\nמחוץ לסדנא, יותם עובד כ-Head of Engineering ב-Trellis.ai, וכמו כן מנחה, מפיק ומשתתף באירועי פואטרי סלאם.",
      //   "file_url": null,
      //   "name": "יותם מנור",
      //   "photo": 'assets/img/yotam_manor.jpg',
      //   "q1": "חזון העמותה (המתוקצר בחופשיות) הוא \"לשחרר את כל המידע הציבורי כך שקל יהיה לכל אזרח ולכל ארגון להשיגו, ולתמוך במערכות קוד פתוח על מנת - להנגיש את המידע, להרחיב את מעגל הנגישות אליו, לעודד דיון אזרחי, להניע את זרימת הידע בחזרה לרשויות, ולסייע לחברה האזרחית להתארגן\".\n\nמטרת העמותה היא לפעול באופן מתמשך להגשמת החזון הזה, דרך פרויקטים ופעילות העמותה ודרך תמיכה והעצמה של פעילות קהילת המתנדבים שהקימה אותה.\n\nהיעד המרכזי של העמותה לתקופה הקרובה הוא לבסס את הקיימות הכלכלית של הארגון, תוך בניית מקורות הכנסה עצמיים על בסיס פרויקטים המקדמים את חזון העמותה. בהמשך, היעדים יתרחבו לחיזוק האימפקט שלנו.\n\nמדד מרכזי לקיימות: אחוז וסכום ההכנסות השנתיות לשימוש כללי של העמותה, חודשי פעילות מובטחים בוודאות גבוהה.\n\nמדדים לאימפקט ומימוש החזון: היקף השימוש בכלי העמותה והקהילה, בולטות תקשורתית והשפעה על השיח הציבורי, הנבטה וגדילה של פרויקטי קהילה. כל אלו, לצערי הרב, נמצאים כרגע בעדיפות משנית ביחס למדד הקיימות. ככל שנתבסס, נוכל לפעול להגשמת היעדים ביתר מיקוד ועל בסיס המשאבים שיעמדו לרשותנו.",
      //   "q2": "אמשיך לסייע למנכ\"לית במימוש תכנית הקיימות והיציבות הכלכלית של העמותה, אנחנו עדיין במים סוערים אבל מתקדמים בדרך ליציבות, למרות הקורונה, ומעוניין להשלים את מה שהתחלנו.\n\nאמשיך להוביל את פעילות הוועד המנהל, כוועד קואפרטיבי ותומך בעמותה ובמנכ\"לית, כקבוצה גדולה מסך חלקיה.\n\nלאור הביקורת העניינית והראויה שמופנית לפעילות הוועד בימים האחרונים, אבקש לדון בסוגיות שעל הפרק ולוודא שפעילות העמותה והוועדת מייצגת נאמנה את עמדת החברים. כל זאת על רקע שגרת קורונה, שאנו נדרשים לתת עליו את הדעת.\n\nזאת לצד בחינה מחודשת של מודל החברות בעמותה, באופן שייגן עליה מפני נסיונות השתלטות עתידיים, שרק צפויים לקרות יותר ככל שנבנה נכסים ונהפוך אטרקטיביים. זאת תוך שמירה על רוח וערכי הקהילה הפתוחים, ככל הניתן. זהו אתגר לא פשוט, וניאלץ להידרש אליו ביחד.",
      //   "current": true
      // },
      {
        "bio": "מנכ\"ל מכון המחקר 'פורום קהלת' עם תקציב של כ-30 מיליון ש\"ח בשנה ו-130 אנשי צוות ושל עמותת-ההזנק 'דיקטה' העוסקת בלמידת מכונה ומפעילה כלים טקסטואליים חינמיים לאקדמאים ולציבור הרחב, עם תקציב של כ-7 מיליון ש\"ח בשנה ו-30 אנשי צוות.\n\nחבר ועד מנהל בשנה האחרונה בסדנא לידע ציבורי ונהנה מכל רגע. חבר גם בוועד המנהל של הפורום הישראלי למנהיגות ושל ארגונים נוספים.\n\nעו\"ד בוגר כלכלה ומשפטים ועם תואר שני במשפט ציבורי, כולם מהאוניברסיטה העברית בירושלים. \n\nאוהב חירות, תחרות ושקיפות. נשוי ואב לשלושה.",
        "file_url": null,
        "name": "מאיר רובין",
        "photo": "https://www.hasadna.org.il/wp-content/uploads/2019/06/Meir-200x200.png",
        "q1": "היעד הוא הנגשת כמה שיותר מידע איכותי ונוח לציבור, באופן שיקל על קבלת ההחלטות האישיות והציבוריות, יקדם תחרות ויוזמות מועילות ויאפשר פיקוח יעיל על הרשויות השונות.\n\nהמדד הראשון הוא קהילת מתנדבים חזקה. זה מה שבנה את הסדנא למה שהיא היום וזהו המנוע שייקח אותה לשלבים הבאים.\n\nהמדד השני הוא יצירת הכנסות משמעותיות מפרוייקטים רשמיים גדולים, שיאפשרו חופש וגיוון בפעילות קבוצות המתנדבים.\n\nהמדד השלישי הוא כמות המשתמשים באתר הסדנא ובכלים השונים, ושביעות הרצון שלהם.",
        "q2": "אני חבר הוועד כיום, וחבר גם בוועדת הכספים. בשנה שחלפה סייעתי למנכ\"לית הסדנא וליו\"ר הוועד בעניינים משפטיים וכלכליים מורכבים, ייעצתי בנושאי כוח-אדם וגבייה, עסקתי בפיתוח תכנים ופעילויות כולל שיתופי פעולה מגוונים עם ארגונים אחרים שאני מוביל או מייעץ להם, שהגדילו את החשיפה של תכני הסדנא והכניסו לה כספים. אשמח לתרום ככל יכולתי גם בשנה הקרובה.",
        "current": true
      },
      {
        "bio": "שמי מיכל להנר ואני סמנכ״לית הכספים של ארגון מעוז, עד לפני שנה ניהלתי גם את גיוס המשאבים של הארגון. בתקופתי בפ״מ הארגון צמח מתקציב של 1.7 מליון דולר לתקציב של 15 מליון דולר ופותחו שותפויות עם ארבעה משרדי ממשלה. אני העובדת הראשון במעוז והייתה לי הזכות להיות חלק מצוות ההקמה. הנסיון שצברתי בשנים האלו נותן לי פרספקטיבה רחבה על האקו-סיסטם של המגזר השלישי, פילנתרופיה ועבודה עם ממשלה ושותפים. את הנסיון הזה אני שמחה לרתום לטובת הסדנא ולסייע בתחומים האלו בדגש על פילנתרופיה שזה שריר שצריך פיתוח בסדנא. בעברי שירתתי כדיפלומטית במשרד החוץ ואני עורכת דין בהכשרתי. \nאמא של איתן ובת הזוג של יהונתן ומתגוררת בעין ורד.",
        "file_url": null,
        "name": "מיכל להנר",
        "photo": "https://www.hasadna.org.il/wp-content/uploads/2019/06/Michal-L-200x200.png",
        "q1": "1. הסדנא צריכה להגדיר את מעגלי התהודה שאליה היא מכוונת את הפרסומים/ הנגשת המידע. הגדרה כפולה- מספרית ואיכותית (מי הן הקבוצות הרלוונטיות לכל פרסום). בנוסף עליה להגדיר את מספר המגעים בכל תקופה עם מעגלי התהודה והתוכן המונגש.\n2. הסדנא צריכה לבחור אזורי מספר מיקוד ולהגביר שם את המאמצים- תחבורה, שלטון מקומי, בריאות...\n3. להגדיר מספר דיונים ציבוריים שהתפתחו בשנה כתוצאה מהנגשת מידע לציבור. אם ניקח לדוגמא, את הדיון הציבורי שהתעורר השנה משיתוף הפעולה עם פרופסור ערן סגל ושאלון הקורונה והדחיפה שהוא נתן למשרד הבריאות לערוך סקרי תסמינים.",
        "q2": null,
        "current": true
      },
      {
        "bio": "אני יזמת, מנהלת ואשה שאוהבת את החיבור בין הטכנולוגיה, עולם האפשריות הנהדרות שהיא פותחת בפנינו, ואת השיפור שהיא יכולה לעשות בחיים שלנו. \nהיום אני מנהלת את מחלקת הפיתוח הכלכלי הבינלאומי של תל אביב, ב'עיר עולם' - תאגיד עירוני של עיריית תל אביב-יפו. מרבית הפעילות שלנו היא מול אקוסיסטם החדשנות והטק, מתוך הבנה שלמזר הציבורי יש תפקיד בתמיכה במגזר הפרטי בדיוק באותן נקודות עיוורות שלו, גם כשהוא תעשיה מתקדמת, מצליחה ומוערכת.\nאל התפקיד הנוכחי הגעתי אחרי 6 שנים בגוף השקעות שהקמתי - Eva Ventures - שהשקיע בסטרטאפים שיש בהם יזמת בצוות המייסדים, וקידם את תחום יזמות הנשים.\nבעבר הרחוק יותר ניהלתי אגף בפלאפון ומוצרים קומברס והייתי שותפה בהקמת סטרטאפ בתחום המדיה.\nאני מנטורית במספר תוכניות יזמות בהן Techstars ו- 8200 Impact\nגרה בתל אביב, עם בן הזוג והצאצא, רצה (קצת), רוכבת (יותר) ושוחה (הכי).",
        "file_url": "https://drive.google.com/open?id=1PTKRcT4ay3ZVjMDU_QKGzVVwojDKPh5kzVqBEwQeyyQ",
        "name": "מיכל מיכאלי",
        "photo": "assets/img/michal_michaeli.jpg",
        "q1": "מאז תחילת החברות שלי בועד המנהל לפני ארבע שנים, אני מלווה את פעילות הסדנא, מתהליך של גדילה והתפתחות היקף ומגוון הפרויקטים ועד לתקופה מאתגרת יותר של הידוק הכיוון והתאמת הפעילות למשאבים ויכולות הקיימים. \nבעיני הסדנא מקפידה פועלת לאור המטרות החזון שלה כגוף המדביר שקיפות ומאפשר מיצוי מידע וידע הספירה הציבורית לטובת הערכים הדמוקרטים. \nיעדים שחשוב להציב ולהבנות את הדרך להשגתם הם בעיקר גידול בהיקף הפעילות, וחיזוק העצמאות של פעילות הסדנא בבניית בסיס פיננסי איתן יותר. בנוסף יעד שהייתי מציבה הוא חיזוק המיתוג של הסדנא הגוף המוביל בידע ציבורי והנגשתו - גם בעזרת הארת הפעילות וגם באמצעות בניית גוף מלווה של תומכים וידידים. יעד נוסף שאני רוצה לקדם הוא הגיוון בין המתנדבים והשותפים של הסדנא - יותר נשים, ערבים ובכלל, מי שלא הטייפקאסט המיידי.\nהמדדים שהייתי מציבה הם מדדי הכנסות ואיתנות פיננסית מחד והשפעה על השיח מאידך.",
        "q2": "אשמח להמשיך ולתרום לסדנא גם המידע והניסיון הנרחב שלי במגוון תפקידים, גם לקידום אותם יעדים בעזרת רשת הקשרים שלי. ועם המרכזיות של פרוייקט data city  - גם מהניסיון הנוכחי בזירה המוניציפאלית.",
        "current": true
      },
      {
        "bio": "אני נעמה כהן, תל אביבית אקטיביסטית. במקצועי אני מנהלת מטה ארגון המתמחים לרפואה ״מרשם״, לשעבר מפיקת פעילויות שטח ומנהלת מטות בקמפיינים פוליטיים. שימשתי כעוזרת הוראה ומנהלת פרוייקטים במחלקה לפוליטיקה וממשל באוניברסיטת בן גוריון ועבדתי כדוברת במועצת הנגב. כמו כן אני בוגרת התוכנית ״פוליטיקאיות צעירות״, בוגרת התוכנית ״עמיתי אברט לצדק חברתי״. דוברת עברית, אנגלית וספרדית.\nאני מתכוונת לתרום לסדנא בתרגום פעילות המקלדת לפעילות שטח, בשדרוג הנוכחות האינטרנטית והחשיפה התקשורתית לפעילות הסדנא ולרתימת נבחרי הציבור לקידום וקיום הסדנא. להרחבה מוזמנות ומוזמנים להציץ בקובץ המצורף.",
        "file_url": "https://drive.google.com/open?id=1zBqL5MSF6SZMsAil8qhdllFRouEPgPDb",
        "name": "נעמה כהן",
        "photo": "assets/img/naama_cohen.jpg",
        "q1": "",
        "q2": ""
      },
      {
        "bio": "חברה בוועד המנהל בשנה האחרונה, ומתנדבת בסדנא מאז 2015. הובלתי את פרויקט ANYWAY בהנהגתו של גל רייך, ולקחתי חלק כמתנדבת גם בפרויקט כנסת פתוחה של הסדנא ובפרויקטים נוספים.\nמובילה את תחום מדעי המחשב במרכז לטכנולוגיה חינוכית (מטח) ומפתחת תכנית חדשנית ללמידה באמצעות בנייה של משחקי מחשב לבתי ספר יסודיים. בוגרת הטכניון במדעי המחשב ותואר שני בטכנולוגיות למידה מאוניברסיטת תל אביב. בעלת ניסיון רב שנים בניהול פרויקטים בהייטק בעיקר בחברות מתחום התקשורת.",
        "file_url": "https://drive.google.com/open?id=1CTE0M8tPEFmRJc035vX67ZD5sSPPqZii",
        "name": "סימונה הולשטיין",
        "photo": "https://www.hasadna.org.il/wp-content/uploads/2019/06/Simona-200x200.png",
        "q1": "יעדי הסדנא הם קידום שקיפות ומעורבות אזרחית באמצעות בניית כלים טכנולוגיים בקוד פתוח לפתיחה והנגשה של מידע המצוי ברשותם של גופי ממשל ומוסדות ציבוריים. מדדים כלליים עבור הסדנא יכולים לנסות ולבחון את רוחב ההשפעה על שקיפות מעורבות אזרחית ונגישות הנתונים יחד עם זאת חשוב שכל אחד מהפרויקטים בסדנא יגדיר לעצמו את המדדים שלו לפי היעדים והמטרות הספציפיים  לפרויקט באפן שתואם את יעדי הסדנא.",
        "q2": "אמשיך לתמוך בעבודת המנכ\"לית לפעילות טובה ומאוזנת של הסדנא. נחפש דרכים חדשות לבסס ולהרחיב את פעילויות הסדנא בשילוב קהילת המתנדבים.",
        "current": true
      },
      {
        "bio": "סקרן. מחובר לארץ. אוהב עברית. עושה מאמץ שליבי ופי יהיו שווים משהו.\nמנהל מנוסה. מתעניין בלמידה, בחדשנות וביצירתיות.\nכיום, אני מנהל את היחידה לחדשנות בהוראה (אותה ייסדתי) במרכז הבינתחומי הרצליה. קודם לכן, ייסדתי וניהלתי מחלקת הפקת תוכן בחברת Time To Know  העולמית שפיתחה טכנו' ותוכניות לימוד לבי\"ס. בעברי, כתבתי תוכניות לימוד עבור עמותת ״חינוך לפסגות״, ושימשתי כמנחה למצוינות בשיטת מיכא”ל. כמו כן, בשנה האחרונה התנדבתי כמנטור למנהיגים צעירים ב\"קו הזינוק\".\nאני אבא ל-2 קטנים. אוהב לנגן (תופים, פסנתר, גיטרה) ולכתוב סיפורים קצרים.\nאני מכיר את העמותה מ-2012, בתקופה בה התעוררתי כאזרח בגל השני של המחאה. לאורך השנים, עקבתי אחר “מפתח התקציב”, ואף הצגתי אותו במשך שנים באתר של היחידה לחדשנות בהוראה כטכנו' למידה לדוגמה. כמו כן, ב-2014, לאחר ששמעתי מגל רייך על החזון שלו להפחתת תאונות, קישרתי אותו למתכנת שפיתח בהתנדבות את הגרסה הראשונה של ANYWAY.\nבכוונתי לתרום לסדנא ב: (א) סיוע להקמת זרוע חינוכית להנגשת מידע  (ב) ייעוץ ובקרה בנושאי תקציב  (ג) ייעוץ למוצרים שבפיתוח  (ד) קידום שת\"פ עם האקדמיה / גופי מחקר.",
        "file_url": "https://drive.google.com/open?id=1yezBlYnqkWypYUD14pZCrPu4CMr1W2Aa",
        "name": "עידן אלמוג",
        "photo": "assets/img/idan_almog.jpg",
        "q1": "1. המשך קידום שקיפות: המשך קידום תהליכי פתיחה והנגשה של מקורות המידע של משרדי ממשלה, תוך שת\"פ עם ארגונים שותפים (לובי 99, שקוף וכו').\n2. עיבוי וטיפוח הקהילה: מתן דגש לעיבוי ולחיזוק הקהילה הקיימת, כולל הגדרת יעדי גיוס של מתנדבים ושל חברים חדשים. \n* על הנהלת העמותה לסייע לכל פרויקט בהגדרת % גידול רצוי, ולתמוך ע\"י מתן מעטפת מנהלתית.\n3. חינוך הציבור למעורבות אזרחית: פיתוח סדנאות לימוד ממוקדות ויישומיות שיפורסמו עבור הקהל הרחב, תוך דגש על הכרת הכלים שפותחו ע\"י הסדנא ועל הנעה למעורבות אזרחית.\n* על הנהלת העמותה להקים \"זרוע חינוכית\" שתתמוך רוחבית בכלל הפרויקטים בנושא.\n4. קידום שת\"פ עם האקדמיה / גופי מחקר: עידוד וסיוע פרויקטים של הסדנא לקיים קשר הדדי ומפרה עם גורמים רלוונטיים ממוסדות לימוד ומחקר, במטרה להגביר את ההשפעה של הפרויקטים ע\"י שילוב תוצריהם במחקרים ובקורסים לימודיים.\n5. ייצוב פיננסי: הנעת תכנית חומש לאיזון תקציבי (הכנסות שוט' = הוצאות שוט'), שתאפשר לסדנא להגיע ליציבות ולעצמאות תפעולית.\n* על הנהלת העמותה לזהות את כל ערוצי הגיוס וההכנסה האפשריים, ולהגדיר יעדי גידול ברורים לכל שנה.",
        "q2": "1. חינוך הציבור למעורבות אזרחית: המומחיות שלי היא \"עיצוב דידקטי\", ולאורך השנים צברתי ניסיון רב בניהול פיתוח והפקת תכני לימוד. מכך, אוכל לייעץ לסדנא בפיתוח מערך חינוכי יעיל ואיכותי שישמש כמכפיל כוח לפרויקטים במאמץ להנגשת המידע לציבור הרחב.\n2. קידום שת\"פ עם האקדמיה / גופי מחקר: כצעד נוסף להגברת השפעת העמותה, וכחלק מהיכרותי את עולם האקדמיה, בכוונתי לעודד את הפרויקטים ולסייע בחשיבה על דרכים ליצירת קשר ושת\"פ עם מרצים / סטודנטים / חוקרים, וזאת על מנת לייצר קשר הדדי מפרה בין הסדנא לבין מוסדות לימוד ומחקר.\n3. ייצוב פיננסי: בשנים האחרונות אני מתכנן ומנהל באופן ישיר תקציב שנתי בסכום של מעל מיליון ש\"ח המשמש עשרות פרוייקטי תוכן וטכנולוגיה. ניסיון זה יאפשר לי לסייע לעמותה בשלבי תכנון ואישור התקציב, בשלבי הבקרה על יישום התקציב, וכן בסיוע במהלך הרחב לייצוב פיננסי.\n4. ייעוץ למוצרים שבפיתוח: במסגרת עבודתי אני מחוייב להתעדכן במגמות טכנולוגיות וצברתי ניסיון ב: אפיון, ליווי פיתוח, וביצוע ריוויו מצד משתמש (פונקציונאלי וממשקי) על טכנו' למידה מגוונות. אני מאמין שאוכל לתרום לפרויקטים הרלוונטיים לשטח זה."
      },
      {
        "bio": "בוגר ממר״מ (התמחות במערכות מידע), 7 שנות שירות | 28 שנים בתפקידי ניהול, הובלה ומנכ״לות בהייטק: מטריקס (פורמולה), נס טכנולוגיות, סאפיינס, בלו פיניקס, בוס, שלקייס ועוד | גייסתי כ-300 מיליון דולר בהנפקות בארה״ב ובגיוסים פרטיים | פעילות החברות הללו הביאה כ-14,000 מקומות עבודה חדשים למשק הישראלי | שותף לתכנון ויישום טכנולוגיות מחשוב במשרדי ממשלה, גופים ציבוריים וביטחוניים, בחברות גדולות במשק ועוד | דובר עברית, אנגלית וצרפתית | אב לשלושה | מתגורר ברמת גן",
        "file_url": "https://drive.google.com/open?id=1qm2jCIK6kIo42d_vjryPczDLZzvktnku",
        "name": "שלום דסקל",
        "photo": "assets/img/shalom_daskal.jpg",
        "q1": "״אין דבר שמספק אותי יותר מלהצטרף לאירגון שהערך שלו גדול יותר מהדו״חות הכספיים שלו, ולסייע להשוות את השניים. שנים עשיתי זאת בהייטק, שנים הבטתי בסדנא מהצד - עכשיו אני כאן.״",
        "q2": "גיוס משאבים - אני דובר הייטקית מדוברת, ומכיר מנהלים רבים בתחום. אשמח לגייסם לתרום ממון או הון אנושי להתנדבות בסדנא.\nקידום הטמעת כלי הסדנא ברשויות ממשלתיות ובחברות ציבוריות - ניסיוני בעבודה מול גופים אלה, ובהקשרים טכנולוגיים, תסייע לי לקדם את השימוש שלהם בכלי הסדנא, כמו גם לנהל שיתופי פעולה ושיתוף מידע דו כיווני.\nבניית Marketecture לסדנא - שילוב של ארכיטקטורה אירגונית ואסטרטגיית שיווק השלובות זו בזו לקידום שקיפות בישראל."
      }
    ];
    for (let i = 0 ; i < this.names.length ; i++ ) {
      this.names[i].index = i; 
      this.vote.push(false);
    }
    console.log(this.vote.length)
    this.randId = Math.floor(Math.random() * 9000000) + 1000000;
    this.swiperConfig.initialSlide = Math.floor(Math.random() * this.names.length);
  }

  encrypt() {
    console.log(this.vote);
    this.encrypted = this.crypt.encrypt(this.randId + '|' + JSON.stringify(this.vote));
  }
  
  select(event) {
    event.target.select();
  }
}
